DeviceProcessEvents 
| join DeviceInfo on DeviceName 
| where FileName contains "java.exe" or FileName contains "javaw.exe"
| where OSPlatform !contains "server" 
| summarize count() by InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, FolderPath, FileName
| sort by count_ desc
